# Pandas Practice

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

rand_mat = randn(5,4)

In [3]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [4]:
index_label = 'A B C D E'.split()
column_label = 'W X Y Z'.split()
df = pd.DataFrame(data = rand_mat, index=index_label , columns=column_label)

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df[['W','Z']] #Selecting columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [7]:
#Creating a new column
df['NEW'] = df['W'] + df['Y']  #just like dictionary

In [8]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [9]:
#Deleteing column
df.drop('NEW', 1, inplace=True)

In [10]:
#Deleteing Row
#df.drop('D', inplace=True) #axix=0 by default

In [11]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
#Selecting Rows
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [13]:
df.loc[['A','C']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [14]:
df.iloc[0] #Selecting by index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [15]:
df.iloc[[0,2]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [16]:
df.loc[['A', 'B']][['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965

### Conditional Selection

In [17]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [20]:
df[df['W']>0]['Y'].loc['B']

-0.8480769834036315

In [21]:
#Multiple condional filtering
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
new_ind = 'CA NY WY OR CO'.split()

In [24]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [25]:
df['States'] = new_ind

In [26]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [27]:
#Setting column as new Index
df.set_index('States', inplace=True)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [29]:
df.dtypes #data types

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [30]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [31]:
df.head()

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [32]:
ser_w = df['W'] > 0
ser_w

States
CA     True
NY     True
WY    False
OR     True
CO     True
Name: W, dtype: bool

In [33]:
ser_w.value_counts()

True     4
False    1
Name: W, dtype: int64

## Group by Operations

In [34]:
#Data for the dataframe
data = {'Company' : ['GOOG', 'GOOG', 'MSFT' ,'MSFT', 'FB','FB' ],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200,120,340,1240,243,350]}

In [35]:
df = pd.DataFrame(data)

In [36]:
df.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa   1240
4      FB     Carl    243

In [37]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     790.0

In [38]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa   1240

In [39]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     636.396103

In [40]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG         MSFT
Sales count    2.000000    2.000000     2.000000
      mean   296.500000  160.000000   790.000000
      std     75.660426   56.568542   636.396103
      min    243.000000  120.000000   340.000000
      25%    269.750000  140.000000   565.000000
      50%    296.500000  160.000000   790.000000
      75%    323.250000  180.000000  1015.000000
      max    350.000000  200.000000  1240.000000

## Pandas Operations

In [41]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [42]:
df['col2'].unique() #list of unique values

array([444, 555, 666], dtype=int64)

In [43]:
df['col1'].nunique() #number of unique values

4

In [44]:
df['col2'].value_counts() #number of each unique value

444    2
555    1
666    1
Name: col2, dtype: int64

In [45]:
#conditional selection
newdf = df[ (df['col1']>2) & (df['col2'] == 444)]

In [46]:
newdf

   col1  col2 col3
3     4   444  xyz

In [47]:
#Applying function to every value in column
def times_2(number):
    return number*2

In [48]:
df['col4'] = df['col1'].apply(times_2)

In [49]:
df

   col1  col2 col3  col4
0     1   444  abc     2
1     2   555  def     4
2     3   666  ghi     6
3     4   444  xyz     8

In [50]:
#df.drop(columns='col4',inplace=True)
del df['col4']

In [51]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [52]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [54]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [55]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [56]:
df.sort_values('col2',ascending=True)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

## Data Input and Output

In [57]:
pwd

'C:\\Users\\rifat\\Desktop\\DL\\Work Dir\\Practice_Folder'

In [61]:
df = pd.read_csv('Data/example.csv')

In [63]:
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [64]:
newDf = df[['a','c']]

In [67]:
newDf.to_csv('Data/new.csv',index=False)